<a href="https://colab.research.google.com/github/brendanpshea/database_sql/blob/main/PSET_Basic_SQL_Commands.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# PSET 4: Basic SQL
### Name: 
### Partner (Optional): 

## Directions
For this problem set, you'll be writing some basic SQL queries. Here is what you need to do:

1. "OPEN" this lab in "Google Colab" and proceed to set up a free Google Colab account if you need to: https://colab.research.google.com/. 
2. Save a copy of this lab to your Colab account. You'll want to connect to a "runtime".
3. Work on the lab! To run code cells, you just need to click "Ctrl + Enter." To edit cells, you can double click on them. If there is an option, make sure to select "Anyone can view" the link.
4. When you are done working on the lab, please download it as an ipnyb file and submit it to D2L.

**Citation:** You don’t need to cite in-class material (from my notes or the lecture books). Any outside material must be cited appropriately.

**Scoring.** Unless noted otherwise, each coding question is worth 3 points. The scoring is as follows:
* 3/3 – The problem is complete and correct.
* 2/3 – The problem is mostly correct.
* 1/3 – The problem is mostly incorrect.
* 0/3 -- The problem is missing or completely incorrect.


---

#Problem 0: Run the cells below
The following two cells  will get the Movie database set up. After you've run these cells (by hitting Ctrl + Enter), you should see the relational schema for each of the Movie databse tables.

Note: The first time you run these cells, it may take a minute or two!

In [ ]:
# Some UNIX utilites we need to install for the lab.
!pip install wget --quiet
!pip install sqlalchemy --quiet
!pip install ipython-sql --quiet

  Building wheel for wget (setup.py) ... done
     |████████████████████████████████| 1.6 MB 4.2 MB/s

In [ ]:
# Now let's download the file we'll be using for this lab
!wget 'https://github.com/brendanpshea/database_sql/raw/main/movie.sqlite' -q

# Let's make a connnection with the database
%load_ext sql
%sql sqlite:////content/movie.sqlite

'Connected: @/content/movie.sqlite'

In [ ]:
# Get the schema
%%sql 
SELECT name AS "Table Name", sql AS "Schema of Table" FROM sqlite_master WHERE type = 'table';

 * sqlite:////content/movie.sqlite
Done.

[('Movie', 'CREATE TABLE Movie (id CHAR(7) PRIMARY KEY, name VARCHAR(64), year INTEGER, rating VARCHAR(5), runtime INTEGER, genre VARCHAR(16), earnings_rank INTEGER)'),
 ('Person', 'CREATE TABLE Person (id CHAR(7) PRIMARY KEY, name VARCHAR(64), dob DATE, pob VARCHAR(128))'),
 ('Actor', 'CREATE TABLE Actor (actor_id CHAR(7), movie_id CHAR(7), PRIMARY KEY (actor_id, movie_id), FOREIGN KEY (actor_id) REFERENCES Person(id), FOREIGN KEY (movie_id) REFERENCES Movie(id))'),
 ('Director', 'CREATE TABLE Director(director_id CHAR(7), movie_id CHAR(7), PRIMARY KEY (director_id, movie_id), FOREIGN KEY (director_id) REFERENCES Person(id), FOREIGN KEY (movie_id) REFERENCES Movie(id))'),
 ('Oscar', 'CREATE TABLE Oscar(movie_id CHAR(7), person_id CHAR(7), type VARCHAR(23), year INTEGER, PRIMARY KEY (person_id, type, year), FOREIGN KEY (movie_id) REFERENCES Movie(id), FOREIGN KEY (person_id) REFERENCES Person(id)\n)')]

In [ ]:
# Show the first 5 rows of each table
movie_df = %sql SELECT * FROM Movie LIMIT 5;
person_df = %sql SELECT * FROM Person LIMIT 5;
actor_df = %sql SELECT * FROM Actor LIMIT 5;
director_df = %sql SELECT * FROM Director LIMIT 5;
oscar_df = %sql SELECT * FROM Oscar LIMIT 5;
print(movie_df,'\n\n',person_df, '\n\n', actor_df, '\n\n', director_df, '\n\n', oscar_df)

 * sqlite:////content/movie.sqlite
Done.
 * sqlite:////content/movie.sqlite
Done.
 * sqlite:////content/movie.sqlite
Done.
 * sqlite:////content/movie.sqlite
Done.
 * sqlite:////content/movie.sqlite
Done.
+---------+------------------------------+------+--------+---------+-------+---------------+
|    id   |             name             | year | rating | runtime | genre | earnings_rank |
+---------+------------------------------+------+--------+---------+-------+---------------+
| 2488496 | Star Wars: The Force Awakens | 2015 | PG-13  |   138   |   A   |       1       |
| 4154796 |      Avengers: Endgame       | 2019 | PG-13  |   181   |  AVS  |       2       |
| 0499549 |            Avatar            | 2009 | PG-13  |   162   |  AVYS |       3       |
| 1825683 |        Black Panther         | 2018 | PG-13  |   134   |  AVS  |       4       |
| 4154756 |    Avengers: Infinity War    | 2018 | PG-13  |   149   |  AVYS |       5       |
+---------+------------------------------+------+--------+---------+-------+---------------+

 +---------+-----------------+------------+-------------------------+
|    id   |       name      |    dob     |           pob           |
+---------+-----------------+------------+-------------------------+
| 0000002 |  Lauren Bacall  | 1924-09-16 | New York, New York, USA |
| 0000004 |   John Belushi  | 1949-01-24 |  Chicago, Illinois, USA |
| 0000006 |  Ingrid Bergman | 1915-08-29 |    Stockholm, Sweden    |
| 0000007 | Humphrey Bogart | 1899-12-25 | New York, New York, USA |
| 0000008 |  Marlon Brando  | 1924-04-03 |   Omaha, Nebraska, USA  |
+---------+-----------------+------------+-------------------------+

 +----------+----------+
| actor_id | movie_id |
+----------+----------+
| 0000138  | 0120338  |
| 0000701  | 0120338  |
| 0000708  | 0120338  |
| 0000870  | 0120338  |
| 0000200  | 0120338  |
+----------+----------+

 +-------------+----------+
| director_id | movie_id |
+-------------+----------+
|   0000116   | 0120338  |
|   0000184   | 0076759  |
|   0011470   | 0298148  |
|   0000229   | 0083866  |
|   0000184   | 0120915  |
+-------------+----------+

 +----------+-----------+-------------------------+------+
| movie_id | person_id |           type          | year |
+----------+-----------+-------------------------+------+
| 6751668  |    None   |       BEST-PICTURE      | 2020 |
| 7286456  |  0001618  |        BEST-ACTOR       | 2020 |
| 7549996  |  0000250  |       BEST-ACTRESS      | 2020 |
| 7131622  |  0000093  |  BEST-SUPPORTING-ACTOR  | 2020 |
| 7653254  |  0000368  | BEST-SUPPORTING-ACTRESS | 2020 |
+----------+-----------+-------------------------+------+

In [ ]:
%%sql
--feel free to type some queries here (and the run them) to see how they work!
--You should only write ONE query per cell.

 * sqlite:////content/movie.sqlite
0 rows affected.

[]

# Problem 1
Retrieve the first 6 rows in the Oscar table ordered by Oscar type. Hint: You'll need to use SELECT, FROM, ORDER BY, and LIMIT. You'll want to retrieve all attributes using *.

**Expected Output**:

| movie_id | person_id | type | year |
|:---:|:---:|:---:|:---:|
| 7286456 | 0001618 | BEST-ACTOR | 2020 |
| 1727824 | 1785339 | BEST-ACTOR | 2019 |
| 4555426 | 0000198 | BEST-ACTOR | 2018 |
| 4034228 | 0000729 | BEST-ACTOR | 2017 |
| 1663202 | 0000138 | BEST-ACTOR | 2016 |
| 2980516 | 1519666 | BEST-ACTOR | 2015 |

In [ ]:
%%sql
--Your code here
SELECT * FROM Oscar ORDER BY Type LIMIT 6;

#Problem 2
Retrieve a list of the different "types" of awards that are listed in the Oscar table. Hint: use DISTINCT.

**Expected Output**

| type |
|:---:|
| BEST-PICTURE |
| BEST-ACTRESS |
| BEST-SUPPORTING-ACTRESS |
| BEST-ACTOR |
| BEST-SUPPORTING-ACTOR |
| BEST-DIRECTOR |

In [ ]:
%%sql
--Your code here

#Problem 3
Retrieve the number of distinct actors that are represented in the Actor table. Hint, you'll neeed to use both COUNT and DISTINCT. You only want each "actor_id" to be counted once.

**Expected Output**: 2199

In [ ]:
%%sql
--Your code here

SELECT COUNT(DISTINCT(actor_id)) FROM Actor

#Problem 4
Retrieve the name and release year of movies that contain the word "Alice".

**Expected Output**: You should retrieve 3 movies.

In [ ]:
%%sql
--Your code here

#Problem 5
Retrieve the name and place of birth of all Persons born in "Kenosha, Wisconsin, USA". Order them in descending order by name.

**Expected output**: The top name on the list should be "Orson Welles."

In [ ]:
%%sql


#Problem 6
Retrieve the names of people who won BEST-ACTRESS or BEST_ACTOR awards in 2010. Hint: You'll need to JOIN Person with Oscar, and use AND or OR to filter the results. The placement of parentheses matters!

**Expected output:** 
Sandra Bullock and Jeff Bridges

In [ ]:
%%sql
--Your code here

#Problem 7
Retrieve the names, runtimes, and release years of movies that have won a 'Best Picture' Oscar. Limit the results to 5. Hint: You'll need to JOIN Oscar and Movie using Oscar.movie_id and Movie.id. You'll also need to think about Oscar.type and Movie.year.

**Expected Output:**

| name | runtime | year |
|:---:|:---:|:---:|
| Parasite | 132 | 2019 |
| Green Book | 130 | 2018 |
| The Shape of Water | 123 | 2017 |
| Moonlight | 111 | 2016 |
| Spotlight | 128 | 2015 |

In [ ]:
%%sql
--Your code here

#Problem 8
Retrieve the COUNT of actors who appeared in a film in 2014. Name this column that is returned "2014 Actors." Hint: You'll need to JOIN Actor with Movie. And rememember to count only "distinct" actor_ids (since some actors will have appeared in multiple movies).

In [ ]:
%%sql
--Your code here

 * sqlite:////content/movie.sqlite
0 rows affected.

[]

#Problem 9
Retrieve the total running time of all of the films that Keanu Reeves has appeared in. Express this as "number of days." (So, you need to convert somehow take the sum of the runtimes, and then convert minutes to days).

In [ ]:
%%sql
--Your code here

 * sqlite:////content/movie.sqlite
0 rows affected.

[]

#Problem 10
Retrieve the names of films that have have a person with a first name starting with the letter "B" as director or an actor. Hint: You'll be doing two "select" statements with a UNION in the middle of them.

In [ ]:
%%sql
--Your code here

 * sqlite:////content/movie.sqlite
0 rows affected.

[]

## Problem 11
Give the name of the person who directed the longest film of 2003 AND the name of this film.

In [ ]:
%%sql
--Your code here

##Problem 12
Determine the number of movies for each “rating” (G, PG, R, etc.) that have won a BEST-PICTURE Oscar.

In [ ]:
%%sql
--Your code here

## Problem 13
Produce a list of the names of people from Minnesota together with a count of the films that each has acted in.

In [ ]:
%%sql
--Your code here

##Problem 14
Create a new database called "Theater" that contains information of movie theaters. It should have columns for theater name, theater location, number of screens, and a theater_id (which should be used as a primary key).

In [ ]:
%%sql
--Your code here

##Problem 15
Insert three sample theaters into this new table.

In [ ]:
%%sql
--Your code here

## Reflection

Assess your preparation for this Problem Set by answering the following questions. 
1.	How long did you spend on the problem set? Did you think this was enough time?
2.	Which specific problems did you feel the most confident about? Which did you feel the least sure about?
3.	Is there anything you learned in the class so far that wasn’t on the exam that you wanted to show mastery of? Tell me about it!